Repository: bletvaska/python-sense-emu
Catalog: sense_emu/locale/*.po
Languages: sk_sk

source: Converts a Sense HAT recording to CSV format, for the purposes of debugging or analysis.
sk_sk: Konvertuje Sense HAT záznam do formátu CSV pre potreby ladenia alebo analýzy.

source: Invalid magic number at start of input
sk_sk: Chybné magické číslo na začiatku vstupu

source: Unrecognized file version number (%d)
sk_sk: Číslo verzie súboru (%d) nebolo rozpoznané

source: Sense HAT Emulator
sk_sk: Sense HAT Emulátor

source: Error
sk_sk: Chyba

source: Another process is currently acting as the Sense HAT emulator
sk_sk: Iný proces sa práve správa ako Sense HAT emulátor

source: Simple
sk_sk: Jednoduché

source: Intermediate
sk_sk: Stredne pokročílé

source: Advanced
sk_sk: Pokročilé

source: Select the recording to play
sk_sk: Vyberte nahrávku na prehrávanie

source: Preferences
sk_sk: Nastavenia

source: %s is not a Sense HAT recording
sk_sk: %s nie je Sense HAT záznam

source: Playing %s
sk_sk: Prehráva sa %s

source: Error while replaying recording
sk_sk: Chyba pri prehrávaní záznamu

source: Playing back recording taken at %s
sk_sk: Prehráva sa záznam vytvorený %s

source: Finished playback of %d records
sk_sk: Ukončilo sa prehrávanie %d záznamov

source: the Sense HAT configuration file to use (default: %(default)s)
sk_sk: konfiguračný súbor Sense HAT, ktorý sa použije (predvolený: %(default)s)

source: configuration filename must end with .ini
sk_sk: súbor s konfiguráciou musí mať príponu .ini

source: Reading settings from %s
sk_sk: Načítavajú sa nastavenia z %s

source: Initializing sensors
sk_sk: Inicializujú sa senzory

source: Failed to initialize Sense HAT IMU
sk_sk: Zlyhala inicializácia jednotky IMU na doske Sense HAT

source: Failed to initialize Sense HAT pressure sensor
sk_sk: Zlyhala inicializácia tlakového senzoru na doske Sense HAT

source: Failed to initialize Sense HAT humidity sensor
sk_sk: Zlyhala inicializácia senzoru vlhkosti na doske Sense HAT

source: Starting recording
sk_sk: Spúšťa sa záznam

source: argument "-" with mode %r
sk_sk: argument "-" s režimom %r

source: can't open '%(name)s': %(error)s
sk_sk: nepodarilo sa otvoriť '%(name)s': %(error)s

source: run under PDB (debug mode)
sk_sk: spustiť s PDB (režim ladenia)

source: Reading configuration from %s
sk_sk: Číta sa konfigurácia z %s

source: unable to locate [%s] section in configuration
sk_sk: nepodarilo sa nájsť sekciu [%s] v konfigurácii

source: Try the --help option for more information.
sk_sk: Viac informácií získate použitím voľby --help.

source: Screen
sk_sk: Obrazovka

source: Rotate the Sense HAT 90 degrees clockwise; after rotation the joystick buttons will produce directions appropriate to the HAT's orientation
sk_sk: Otočí Sense HAT o 90 stupňov v smere hodinových ručičiek; po otočení budú tlačidlá joysticku produkovať smery zodpovedajúce otočeniu dosky

source: Rotate the Sense HAT 90 degrees counter-clockwise; after rotation the joystick buttons will produce directions appropriate to the HAT's orientation
sk_sk: Otočí Sense HAT o 90 stupňov proti smeru hodinových ručičiek; po otočení budú tlačidlá joysticku produkovať smery zodpovedajúce otočeniu dosky

source: Temperature
sk_sk: Teplota

source: Pressure
sk_sk: Tlak

source: Humidity
sk_sk: Vlhkosť

source: Orientation
sk_sk: Orientácia

source: Stop
sk_sk: Zastaviť

source: _File
sk_sk: _Súbor

source: _Open example
sk_sk: _Otvoriť príklad

source: _Replay recording...
sk_sk: _Prehrať záznam...

source: _Quit
sk_sk: _Ukončiť

source: _Edit
sk_sk: _Upraviť

source: _Preferences...
sk_sk: _Nastavenia...

source: _Help
sk_sk: _Pomocník

source: Contents
sk_sk: Obsah

source: _About...
sk_sk: _O programe...

source: Simulate
sk_sk: Simulovať

source: Screen updates
sk_sk: Aktualizácia obrazovky

source: Environment sensors
sk_sk: Senzory prostredia

source: When checked, the emulator will continually simulate "noise" on the environment sensors (the temperature, pressure, and humidity sliders)
sk_sk: Po zvolení bude emulátor neustále simulovať "šum" na senzoroch prostredia (posuvníky teploty, tlaku a vlhkosti)

source: Inertial measurement unit
sk_sk: Inerciálna meracia jednotka

source: Sets the maximum rate at which the emulated pixel display can update. The real HAT updates at 60fps but emulation at this speed can cause issues on slower Pi's
sk_sk: Nastaví maximálnu frekvenciu aktualizácie emulovaného displeja. Skutočný HAT má frekvenciu aktualizácii 60fps, ale emulácia pri tejto rýchlosti môže spôsobovať problémy na pomalších počítačoch Pi

source: Orientation scale
sk_sk: Stupnica orientácie

source: When selected, the orientation sliders will have a minimum of -180°, a mid-point at 0°, and a maximum of 180°
sk_sk: Po zvolení budú mať posuvníky orientácie minimum -180°, stred 0° a maximum 180°

source: When selected, the orientation sliders will have a minimum of 0°, a mid-point at 180°, and a maximum of 360°
sk_sk: Po zvolení budú mať posuvníky orientácie minimum 0°, stred 180° a maximum 360°

source: When selected, the orientation sliders will have a minimum of 180°, a mid-point at 0° (immediately after 359°), and a maximum of 180°
sk_sk: Po zvolení budú mať posuvníky orientácie minimum 180°, stred 0° (okamžite po 359°) a maximum 180°

source: Editor command
sk_sk: Príkaz na spustenie editora
